9/data/attachments/d8b1518e1a840a94.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_034437aa-e179-48af-b527-98e33272c2ae</nif:username>
            <nif:friendToBeAdded>Justin_firm_Actions_32376_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>